<a href="https://colab.research.google.com/github/CarlosLeandro09/DataAnalysisRadiology/blob/main/Um_pouco_de_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Basic stage**

**1.** Importações importantes para um estágio inicial

In [3]:
import pandas as pd
import numpy as np

**2.** Dados em uma escala temporal: **Séries**

In [4]:
series = pd.Series([np.nan, 0, 1, 2])
series

0    NaN
1    0.0
2    1.0
3    2.0
dtype: float64

**3.** Ainda relativo a séries, vamos "manipular" **datas**...

pd.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs)

In [5]:
datas = pd.date_range("20200101",periods=4,freq="D")
datas

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04'], dtype='datetime64[ns]', freq='D')

**4.** Criação de **DataFrame**

In [6]:
df = pd.DataFrame(np.random.randn(4,4), index = datas, columns = list("ABCD"))
df

                   A         B         C         D
2020-01-01 -0.443190  0.732016  2.177361 -0.141994
2020-01-02 -0.905692  0.762564 -0.873843 -0.848396
2020-01-03 -0.768921  0.159921  0.174931  0.813558
2020-01-04 -0.261737  0.165556  1.829371 -0.674890

In [7]:
df2 = pd.DataFrame({"A":7,
                    "B":pd.Series(1,index=list(range(5)),dtype="float32"),
                    "C":np.array([3]*5,dtype="int32"), 
                    "D":pd.Categorical(["Carro","Coelho","Caipora","Cigarro","Cinema"]),
                    "E":pd.Timestamp("20190204"),
                    "F":"Dragonball"})
df2

   A    B  C        D          E           F
0  7  1.0  3    Carro 2019-02-04  Dragonball
1  7  1.0  3   Coelho 2019-02-04  Dragonball
2  7  1.0  3  Caipora 2019-02-04  Dragonball
3  7  1.0  3  Cigarro 2019-02-04  Dragonball
4  7  1.0  3   Cinema 2019-02-04  Dragonball

In [8]:
df2.head(3)

   A    B  C        D          E           F
0  7  1.0  3    Carro 2019-02-04  Dragonball
1  7  1.0  3   Coelho 2019-02-04  Dragonball
2  7  1.0  3  Caipora 2019-02-04  Dragonball

In [9]:
df2.tail(3)

   A    B  C        D          E           F
2  7  1.0  3  Caipora 2019-02-04  Dragonball
3  7  1.0  3  Cigarro 2019-02-04  Dragonball
4  7  1.0  3   Cinema 2019-02-04  Dragonball

In [10]:
df2.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [14]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [11]:
#df --> Tira índices e colunas
df.to_numpy()

array([[-0.44318953,  0.73201552,  2.17736141, -0.1419937 ],
       [-0.90569227,  0.76256411, -0.87384283, -0.84839626],
       [-0.76892135,  0.15992068,  0.17493098,  0.8135578 ],
       [-0.26173686,  0.16555593,  1.82937072, -0.6748897 ]])

In [12]:
df2.dtypes

A             int64
B           float32
C             int32
D          category
E    datetime64[ns]
F            object
dtype: object

In [15]:
df2.shape

(5, 6)

**5.** Adição de **colunas** ao DataFrame

In [16]:
df2["G"] = pd.Series("RX",index=list(range(5)),dtype="str")
df2

   A    B  C        D          E           F   G
0  7  1.0  3    Carro 2019-02-04  Dragonball  RX
1  7  1.0  3   Coelho 2019-02-04  Dragonball  RX
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX
3  7  1.0  3  Cigarro 2019-02-04  Dragonball  RX
4  7  1.0  3   Cinema 2019-02-04  Dragonball  RX

**6.** **Operação** entre colunas

In [17]:
df2["Soma"] = df2["A"] + df2["C"]
df2

   A    B  C        D          E           F   G  Soma
0  7  1.0  3    Carro 2019-02-04  Dragonball  RX    10
1  7  1.0  3   Coelho 2019-02-04  Dragonball  RX    10
2  7  1.0  3  Caipora 2019-02-04  Dragonball  RX    10
3  7  1.0  3  Cigarro 2019-02-04  Dragonball  RX    10
4  7  1.0  3   Cinema 2019-02-04  Dragonball  RX    10

In [18]:
#Transposta
df2.T

                        0  ...                    4
A                       7  ...                    7
B                       1  ...                    1
C                       3  ...                    3
D                   Carro  ...               Cinema
E     2019-02-04 00:00:00  ...  2019-02-04 00:00:00
F              Dragonball  ...           Dragonball
G                      RX  ...                   RX
Soma                   10  ...                   10

[8 rows x 5 columns]

**7.** **Concatenando** dataframes

In [19]:
df1 = pd.DataFrame(np.random.randn(2,2), index = pd.date_range("20190104",periods=2,freq="D"), columns = list("AB"))
df2 = pd.DataFrame(np.random.randn(2,2), index = pd.date_range("20190106",periods=2,freq="D"), columns = list("AB"))
df3 = pd.DataFrame(np.random.randn(2,2), index = pd.date_range("20190108",periods=2,freq="D"), columns = list("AB"))

In [20]:
combinacao = pd.concat([df1,df2,df3],keys=["df1","df2","df3"])
combinacao

                       A         B
df1 2019-01-04 -1.448840  0.720251
    2019-01-05  0.629032  0.924831
df2 2019-01-06 -0.402103  0.950435
    2019-01-07 -0.266624  0.476842
df3 2019-01-08  1.722589  1.125264
    2019-01-09  0.115400 -0.700174

In [21]:
#Removendo valores repetidos
combinacao["ValoresRepetidos"] = list("XYXKXL")
combinacao.drop_duplicates(subset="ValoresRepetidos")

                       A         B ValoresRepetidos
df1 2019-01-04 -1.448840  0.720251                X
    2019-01-05  0.629032  0.924831                Y
df2 2019-01-07 -0.266624  0.476842                K
df3 2019-01-09  0.115400 -0.700174                L

In [22]:
#"Selecionando" informações da coluna
combinacao["A"]

df1  2019-01-04   -1.448840
     2019-01-05    0.629032
df2  2019-01-06   -0.402103
     2019-01-07   -0.266624
df3  2019-01-08    1.722589
     2019-01-09    0.115400
Name: A, dtype: float64

In [23]:
#Selecionando key
combinacao.loc["df1"]

                   A         B ValoresRepetidos
2019-01-04 -1.448840  0.720251                X
2019-01-05  0.629032  0.924831                Y

**8.** Aplicando **Merge**

In [24]:
df4 = pd.DataFrame({'ID': [123,321,231,213],
                    'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5],
                    'Compras':[00,11,22,33]})
df5 = pd.DataFrame({'ID': [123,323,231,212],
                    'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [ ]:
#Intersecção --> Valores iguais
pd.merge(df4,df5,how="inner",on=["ID"],suffixes=["_A","_B"])

    ID lkey  value_A rkey  value_B
0  123  foo        1  foo        5
1  231  baz        3  baz        7

In [25]:
#Left join --> Valores iguais + conjunto da esquerda
pd.merge(df4,df5,how="left",on='ID')

    ID lkey  value_x  Compras rkey  value_y
0  123  foo        1        0  foo      5.0
1  321  bar        2       11  NaN      NaN
2  231  baz        3       22  baz      7.0
3  213  foo        5       33  NaN      NaN

In [26]:
#Outer --> Compara os df's para cada ID reportando lados
pd.merge(df4,df5,how='outer',on='ID',indicator=True)

    ID lkey  value_x  Compras rkey  value_y      _merge
0  123  foo      1.0      0.0  foo      5.0        both
1  321  bar      2.0     11.0  NaN      NaN   left_only
2  231  baz      3.0     22.0  baz      7.0        both
3  213  foo      5.0     33.0  NaN      NaN   left_only
4  323  NaN      NaN      NaN  bar      6.0  right_only
5  212  NaN      NaN      NaN  foo      8.0  right_only